-- =====================================================
-- 회원가입
-- =====================================================

INSERT 
  INTO user (
			    team_id
			  , login_id
			  , login_pw
			  , email
			  , name
			  , nickname
			  , gender
			  , birth_date) 
VALUES (10, 'test', 'test123', 'test@ex.com', '테스트', 'T1', 'F', '1997-09-18');

SELECT * FROM user;


-- =====================================================
-- 로그인
-- =====================================================

SELECT
		 COUNT(1) AS '로그인 성공 여부'
  FROM user
 WHERE login_id = 'test'
	AND login_pw = 'test123';
	

-- =====================================================
-- 회원 정보 수정
-- =====================================================

UPDATE user
	SET nickname = '닉네임수정테스트'
 WHERE user_id = 33;
 
 SELECT * FROM user;
 

-- =====================================================
-- 아이디 찾기
-- =====================================================

SELECT login_id AS '아이디'
  FROM user
 WHERE email = 'test@ex.com'
 
 
-- =====================================================
-- 비밀번호 찾기(새 비밀번호 설정)
-- =====================================================

UPDATE user
	SET login_pw = 'changePW'
 WHERE user_id = (
 						SELECT user_id
  						  FROM user
 						 WHERE login_id = 'test'
 );

SELECT * FROM user;


-- =====================================================
-- 회원 탈퇴
-- =====================================================

UPDATE user
	SET is_deleted = 1
 WHERE user_id = 33;
 
SELECT * FROM user;


-- =====================================================
-- 다른 회원 차단
-- 회원 차단
-- =====================================================

INSERT
  INTO user_block (
  		 blocker_id
  	  , blocked_id)
VALUES (33, 1);

SELECT * FROM user_block;


-- =====================================================
-- 다른 회원 차단
-- 회원 차단 해제
-- =====================================================

UPDATE user_block
	SET is_deleted = 1
 WHERE block_id = 1;
 
SELECT * FROM user_block;


-- =====================================================
-- 마이페이지
-- 본인 게시글 조회
-- =====================================================

SELECT *
  FROM board
 WHERE user_id = 6
 	AND is_deleted != 1;
 
 
-- =====================================================
-- 본인 댓글 조회
-- =====================================================

SELECT *
  FROM comment
 WHERE user_id = 6
 	AND is_deleted != 1;


-- =====================================================
-- 경기 관람 내역 다이어리 작성
-- =====================================================

INSERT
  INTO diary (
  		 text
  	  , user_id
  	  , game_id)
VALUES ('오늘 경기 후기~', 4, 20);

SELECT * FROM diary WHERE diary_id = 21;


-- =====================================================
-- 경기 관람 내역 다이어리 삭제
-- =====================================================

UPDATE diary
	SET is_deleted = 1
 WHERE diary_id = 21;
 
SELECT * FROM diary WHERE diary_id = 21;


-- =====================================================
-- 경기 관람 내역 다이어리 조회
-- =====================================================

SELECT *
  FROM diary
 WHERE user_id = 4
	AND is_deleted != 1;
	

-- =====================================================
-- 회원 포인트 조회
-- =====================================================

SELECT point
  FROM user
 WHERE user_id = 4;
 
 
-- =====================================================
-- 회원 포인트 이력 조회
-- =====================================================

SELECT *
  FROM point_log
 WHERE user_id = 4;
 

-- =====================================================
-- 북마크 조회
-- =====================================================

SELECT *
  FROM bookmark
 WHERE user_id = 4
	AND is_deleted != 1;